adjusted block diagram description
